[
  {
    "id": 1,
    "name": "Frengp",
    "logoWhite": "src/assets/images/schools/logos/frengplogowhite.png",
    "logo": "src/assets/images/schools/logos/frengplogo.png",
    "image": "src/assets/images/schools/photos/frengp.jpg",
    "alt": "Frengp",
    "years": "2016 - 2020",
    "type": "High School",
    "description": "I completed a four-year Informační technologie (Information Technology) program at Střední průmyslová škola elektrotechniky a informatiky ve Frenštátě pod Radhoštěm, graduating with a maturitní zkouška. During my studies I gained solid foundations in computer systems, networking, programming, databases, cybersecurity, and practical IT skills such as system administration and software deployment. This education equipped me with both technical expertise and problem-solving abilities, preparing me for further studies and a career in the IT field."
  },
  {
    "id": 2,
    "name": "University of Ostrava",
    "logoWhite": "src/assets/images/schools/logos/osulogowhite.png",
    "logo": "src/assets/images/schools/logos/osulogo.png",
    "image": "src/assets/images/schools/photos/osu.jpg",
    "alt": "Osu",
    "years": "2020 - 2024",
    "type": "College",
    "description": "I studied Applied Informatics (Softwarové systémy) at the Faculty of Science of the Univerzita Ostrava, where the program focused on combining foundational theory with practical software development and IT system skills. Throughout my studies I gained expertise in areas such as programming, system design, database management, web and mobile application development, and IT security, while also building soft skills for teamwork and project leadership. This education prepared me to design, develop, and maintain modern software systems and equipped me with the tools to continue learning and growing in the tech industry."
  },

  {
    "id": 3,
    "name": "L'Aquila University",
    "logoWhite": "src/assets/images/schools/logos/univaqlogowhite.png",
    "logo": "src/assets/images/schools/logos/univaqlogo2.png",
    "image": "src/assets/images/schools/photos/univaq.jpg",
    "alt": "Univaq",
    "years": "2024 - 2025",
    "type": "Erasmus",
    "description": "During my Erasmus semester at Università degli Studi dell’Aquila, I took advanced courses in Artificial Intelligence, Software Architectures, Software Engineering for the Internet of Things, Software Quality Engineering, and Italian Language for Foreigners (A1). This experience broadened my technical knowledge in cutting-edge areas of software and IoT systems while enhancing my understanding of software design principles, quality assurance, and AI techniques. Living and studying in Italy also helped me develop intercultural communication skills and gain a foundation in Italian, making the semester both academically enriching and personally transformative."
  }
]
